[
	{
		"id": 6,
		"title": "GameStash",
		"summary": "<p>Free video game cataloging service using a PEVN stack.</p>",
		"thumbnail": "default.jpg",
		"fullimage": "header.jpg",
		"url": "gamestash",
		"fulltext": "<p>Built a free to use video game cataloging service using a PEVN (Postgres, Express, Vue.js, Node.js) stack. Utilizes Twitch.tv’s IGDB (Internet Games Database) API to pull video game meta data for cataloging. Users can create accounts to keep track of their personal video game collection.</p>",
		"images": ["screenshot_1.jpg", "screenshot_2.jpg", "screenshot_3.jpg"],
		"link": "https://gamestash.app/",
		"tools": [
			"Vue.js",
			"Node.js",
			"Express",
			"Postgres",
			"HTML5",
			"SASS",
			"JavaScript"
		]
	},
	{
		"id": 4,
		"title": "CVBERPUNK",
		"summary": "<p>Niche website / social media centered around the science fiction genre <strong><em>CYBERPUNK</em></strong>.</p>",
		"thumbnail": "default.jpg",
		"fullimage": "header.jpg",
		"url": "cvberpunk",
		"fulltext": "<p>Started as an Instagram account sharing content centered around the science fiction genre: <strong><em>CYBERPUNK</em></strong>. My Instagram account quickly grew to thousands of users, and then to over 10,000 over a couple of years.</p><p>Taking my existing userbase I decided to turn the social media account I grew into an E-commerce website. I have done freelance work in the past building out WordPress / WooCommerce websites for small businesses, so it was a platform I was familiar with. But I had never built a custom theme completely from scratch.</p><p>Without time or cost restraints I wanted to build a WordPress site that was lightweight and fast. Using previous experience with Unix servers I set up a droplet on DigitalOcean and configured NGINX to serve pages as fast as possible. I built out a lightweight WordPress theme from the ground up using the least amount of plugins I could and staying away from large CSS, JavaScript, and image files as much as I could.</p><p>It was the fastest website I had ever built receiving a mobile score of 71 and desktop score of 95 from Google PageSpeed Insights.</p><p>I now maintain the site and social media account as hobbies. And use them as creative outlets to design graphic t-shirts.</p>",
		"images": ["image1.jpg", "image3.jpg", "image4.jpg"],
		"link": "https://www.cvberpunk.com",
		"social": "https://www.instagram.com/cvberpunk",
		"tools": [
			"PHP",
			"MySQL",
			"WordPress",
            "Woocommerce",
			"HTML5",
			"CSS",
			"JavaScript",
			"Unix",
			"NGINX",
            "Photoshop"
		]
	},
	
	{
		"id": 2,
		"title": "YoyoPoyo",
		"summary": "<p>Puzzle game developed in 24 hours for the <strong><em>2021 GameMaker Game Jam</em></strong> game development event.</p>",
		"thumbnail": "default.jpg",
		"fullimage": "header.jpg",
		"url": "yoyopoyo",
		"fulltext": "<p>YoyoPoyo is a puzzle game made in Unity for the 2021 GameMaker Game Jam development event. This particular game jam lasted 48 hours, however I joined late and only had about 24 hours to develop this game.</p><p><a target=\"_blank\" href=\"https://itch.io/jam/gmtk-2021\">Learn more about the event here</a></p><p>The theme for the event was <strong>\"Joined Together\"</strong>. My game centers around two characters that are both controlled by the same input so that they mimic each other. Using the environment the player can re-position the characters relative to each other to solve puzzles.</p><p>All code and art assets were created within the 24 hours that I worked on the project.</p><p>You can see <a target=\"_blank\" href=\"https://itch.io/jam/gmtk-2021/rate/1080261\">how well my game was rated</a> in different categories among 5,742 other entries.</p>",
		"images": ["image1.gif", "image2.jpg", "image3.jpg"],
		"video": "IvLOORdOnH4",
		"link": "https://tengusheath.itch.io/yoyopoyo",
		"tools": ["C#", "Unity", "Aseprite"]
	},
	{
		"id": 1,
		"title": "10,001: A space exploration game",
		"summary": "<p>Space exploration game developed in 48 hours for the <strong><em>Ludum Dare 48</em></strong> game development event.</p>",
		"thumbnail": "default.jpg",
		"fullimage": "header.jpg",
		"url": "10001",
		"fulltext": "<p><strong>10,001: A space exploration game</strong>, made in Unity, is a game about the vast emptiness of space, inspired by classic science fiction. It was developed in 48 hours for the Ludum Dare 48 game development event.</p><p><a target=\"_blank\" href=\"https://ldjam.com/\">Learn more about Ludum Dare here</a></p><p>The theme for this event was <strong>\"Deeper and Deeper\"</strong>. My game focuses on exploring deep space and the isolation that comes with it. The player pilots a spacecraft that can fire a weapon to fight an invading alien species while they try to explore surrounding areas.</p><p>Each Ludum Dare has two types of submissions with different deadlines: the \"Compo\" at 48 hours and \"Jam\" at 72 hours. All code and art assets were made in 48 hours for the \"Compo\" submission.</p><p>You can <a target=\"_blank\" href=\"https://ldjam.com/events/ludum-dare/48/10001\">see how well my game was rated</a> in different categories among 3,866 submissions.</p>",
		"images": [
			"image6.gif",
			"image2.jpg",
			"image3.jpg",
			"image4.jpg",
			"image5.jpg",
			"image7.gif"
		],
		"video": "s-cRw_E-IuE",
		"link": "https://tengusheath.itch.io/10001",
		"tools": ["C#", "Unity", "Photoshop", "Aseprite", "FL Studio"]
	},
	{
		"id": 3,
		"title": "Strange Planet",
		"summary": "<p>Top down shooter game developed in 72 hours for the <strong><em>Ludum Dare 47</em></strong> game development event.</p>",
		"thumbnail": "default.jpg",
		"fullimage": "header.jpg",
		"url": "strange-planet",
		"fulltext": "<p><strong>Strange Planet</strong> was my first game jam development event submission I have ever done. It is a top down shooter made in 72 hours with Unity for the Ludum Dare 47 game development event.</p><p><a target=\"_blank\" href=\"https://ldjam.com/\">Learn more about Ludum Dare here</a></p><p>The theme for this event was <strong>\"Stuck in a Loop\"</strong>. The player controls an astronaut stranded on a planet that is infinitely looped around to the same screen, while trying to survive against an alien attack that gets more difficult with each passing day.</p><p>Each Ludum Dare has two types of submissions with different deadlines: the \"Compo\" at 48 hours and \"Jam\" at 72 hours. All code and art assets were made in 72 hours for the \"Jam\" submission.</p><p>You can <a target=\"_blank\"  href=\"https://ldjam.com/events/ludum-dare/47/strange-planet\">see how well my first game jam event game rated</a> in different categories among 3,206 other submissions.</p>",
		"images": ["image1.jpg", "image2.jpg", "image3.jpg"],
		"video": "y2vkuY0ZDYQ",
		"link": "https://tengusheath.itch.io/strange-planet",
		"tools": ["C#", "Unity", "Aseprite", "Audacity"]
	}
]
